Revit 2027 API
View.HideCategoryTemporary Method
 Set one category to be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideCategoryTemporary(
	ElementId elementId
)
Public Sub HideCategoryTemporary (
	elementId As ElementId
)
public:
void HideCategoryTemporary(
	ElementId^ elementId
)
member HideCategoryTemporary :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 Id of the category to be hidden
Exceptions
Exception | Condition
ArgumentException |  elementId does not correspond to a Category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace